pgfds-metrics/old_logs/benchmark_logs/20250321_113913/benchmark_100_rps.log
Running 5m test @ http://localhost:5000
  4 threads and 100 connections
  Thread calibration: mean lat.: 73.107ms, rate sampling interval: 407ms
  Thread calibration: mean lat.: 72.335ms, rate sampling interval: 458ms
  Thread calibration: mean lat.: 63.033ms, rate sampling interval: 378ms
  Thread calibration: mean lat.: 55.775ms, rate sampling interval: 352ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    67.93ms   83.30ms 421.89ms   78.51%
    Req/Sec    24.70     24.51    71.00     76.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.25ms
 75.000%  131.46ms
 90.000%  205.05ms
 99.000%  291.07ms
 99.900%  344.06ms
 99.990%  396.54ms
 99.999%  422.14ms
100.000%  422.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.493     0.000000            1         1.00
       6.031     0.100000         2894         1.11
       8.063     0.200000         5789         1.25
      10.351     0.300000         8686         1.43
      13.439     0.400000        11579         1.67
      18.255     0.500000        14475         2.00
      22.655     0.550000        15916         2.22
      32.079     0.600000        17362         2.50
      47.903     0.650000        18813         2.86
      88.703     0.700000        20257         3.33
     131.455     0.750000        21706         4.00
     145.919     0.775000        22427         4.44
     159.103     0.800000        23153         5.00
     169.983     0.825000        23877         5.71
     180.735     0.850000        24599         6.67
     191.743     0.875000        25325         8.00
     198.143     0.887500        25682         8.89
     205.183     0.900000        26052        10.00
     212.607     0.912500        26405        11.43
     220.287     0.925000        26769        13.33
     228.607     0.937500        27130        16.00
     233.343     0.943750        27311        17.78
     238.719     0.950000        27491        20.00
     244.351     0.956250        27673        22.86
     249.727     0.962500        27853        26.67
     256.383     0.968750        28035        32.00
     260.095     0.971875        28124        35.56
     264.191     0.975000        28216        40.00
     268.287     0.978125        28305        45.71
     272.383     0.981250        28394        53.33
     279.295     0.984375        28487        64.00
     282.111     0.985938        28530        71.11
     286.207     0.987500        28578        80.00
     288.767     0.989062        28622        91.43
     293.887     0.990625        28669       106.67
     298.239     0.992188        28712       128.00
     301.055     0.992969        28733       142.22
     304.127     0.993750        28758       160.00
     307.199     0.994531        28780       182.86
     311.551     0.995313        28804       213.33
     314.623     0.996094        28823       256.00
     317.183     0.996484        28835       284.44
     321.279     0.996875        28847       320.00
     324.095     0.997266        28857       365.71
     327.167     0.997656        28869       426.67
     330.495     0.998047        28880       512.00
     333.567     0.998242        28886       568.89
     336.127     0.998437        28891       640.00
     339.711     0.998633        28898       731.43
     342.015     0.998828        28903       853.33
     344.063     0.999023        28909      1024.00
     347.647     0.999121        28911      1137.78
     351.231     0.999219        28914      1280.00
     352.255     0.999316        28917      1462.86
     353.023     0.999414        28920      1706.67
     358.655     0.999512        28922      2048.00
     366.335     0.999561        28924      2275.56
     366.591     0.999609        28925      2560.00
     373.759     0.999658        28927      2925.71
     376.063     0.999707        28928      3413.33
     383.231     0.999756        28929      4096.00
     389.631     0.999780        28931      4551.11
     389.631     0.999805        28931      5120.00
     394.751     0.999829        28932      5851.43
     394.751     0.999854        28932      6826.67
     396.543     0.999878        28933      8192.00
     396.543     0.999890        28933      9102.22
     415.743     0.999902        28934     10240.00
     415.743     0.999915        28934     11702.86
     415.743     0.999927        28934     13653.33
     421.631     0.999939        28935     16384.00
     421.631     0.999945        28935     18204.44
     421.631     0.999951        28935     20480.00
     421.631     0.999957        28935     23405.71
     421.631     0.999963        28935     27306.67
     422.143     0.999969        28936     32768.00
     422.143     1.000000        28936          inf
#[Mean    =       67.933, StdDeviation   =       83.299]
#[Max     =      421.888, Total count    =        28936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29979 requests in 5.00m, 37.46MB read
Requests/sec:     99.92
Transfer/sec:    127.87KB